# Скачиваем базовый образ golang для нашего приложения
FROM golang:1.21.7
# Создаём каталог внутри создаваемого образа
WORKDIR /app
# Копируем наши файлы с зависимостями из исходного кода в внутрь созданного образа
# COPY go.mod go.sum ./
# Следующая команда копирует все файлы .go из исходного кода в внутрь созданного образа
# COPY *.go ./
# Или можно скопировать все файлы исходного кода в внутрь созданного образа
COPY ./ ./
# Загружаем все модули для работы нашего приложения
RUN go mod download
# Компилируем наше приложение (файл main.go) в бинарный файл с именем chat-main в корень файловой системы образа
RUN go build -o chat-main ./cmd/service
# Указываем Docker, какую команду следует запускать, когда образ используется для запуска контейнера
# Т.е. как будто мы в терминале контейнера вводим команду
CMD ["./chat-main"]


